// Напишите программу, которая на вход принимает число и выдает его квадрат (число, умноженное на само себя);
// 4 -> 16;
// -3 -> 9;
// -7 -> 49;

Console.WriteLine("Input number");
int number = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number * number);
