// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
// 456 -> 6;
// 782 -> 2;
// 918 -> 8;

Console.WriteLine(Convert.ToInt32(Console.ReadLine()) % 10);
